//  大学计算机基础
//  计算机辅助设计技术基础教程
//  人工智能导论
//  数据结构(C语言版) 严蔚敏,吴伟民
//  图论与代数结构
//  数值分析
//  数字逻辑
//  操作系统概念
//  计算机操作系统教程
//  操作系统----内核与设计原理(第四版)
//  计算机网络
//  计算机网络技术基础
//  计算机原理
//  计算机系统结构
//  计算机网络原理
//  编译原理    
//  计算机图形学
//  计算机导论
//  多媒体技术基础及应用
//  数字系统设计自动化
//  虚拟现实技术概述
//  数理逻辑与集合论
//  数理逻辑与集合论 精要与题解
//  C++面向对象程序设计
//  C程序设计(第二版)
//  数据库系统设计与原理
//  程序设计实践
//  文本数据挖掘和语义
//  Web以及Web 服务
//  嵌入式计算系统设计原理
//  Linux与嵌入式系统
//  人工神经网络的模型及其应用
//  C语言程序设计
//  操作系统概念
//  汇编语言程序设计
//  JAVA程序设计

//  数据挖掘概念与技术
//  Hadoop权威指导
//  搜索引擎--信息检索实践

//  设计模式——可复用面向对象的软件元素
//  编程之美
//  算法导论
//  重构

//  线性代数
//  离散数学